Public Attributes | List of all members
ACAPI::MEP::PipeElbowPreferenceTable::Key Struct Reference
MEP Element Manager
The key that uniquely identifies a row in the PipeElbowPreferenceTable. More...
#include <MEPPipeElbowPreferenceTable.hpp>
 Public Attributes
 uint32_t  | referenceId
The referenceId of the row. The table only contains the referenceIds that are defined in the PipeReferenceSet.
 double  | angle
The angle of the row. The table only contains the angles that are defined in the PipeAngleSet. Needs to be between [1, 90] degrees.
Detailed Description
The key that uniquely identifies a row in the PipeElbowPreferenceTable.
Since
Archicad 29